[
  {
    "Review Text":"Great service and very friendly.",
    "Date":"28th January 2025",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Prof Shaikh was emphatic and I felt totally at ease and trusted him implicitly. He was able to make me feel so much better following Botox injection for a fissure. Following this I was able to come off amitriptyline, which was great. It is reassuring to know that should I need any further treatment I have Prof Shaikh!",
    "Date":"28th January 2025",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Prof Shaikh gave me superb care, from our first appt, he was very clear and explained my condition and procedure extremely well, allowing questions from both me and my husband. Following the surgery, he was encouraging, compassionate and clear  in our interactions, whether face to face or on the phone. His positivity and encouragement helped me recover I believe as fast as possible too as I was keen to do everything I could to help myself recover. \nI consider myself incredibly lucky, my cancer was picked up on routine bowel screening, thanks to a 60th  birthday FIT test from the NHS. I had no symptoms. I was seen very quickly by Prof, following colonoscopy,  when he explained that he would operate using robotic surgery  which I had never heard of. This meant that my  operation, took place internally without the need or risks of open surgery. The apertures for the robot were small and healed quickly  afterwards and I was ready for discharge on day 4. \nI am  grateful for the NHS Bowel Screening Programme, and to Prof Shaikh, robot and team.",
    "Date":"28th January 2025",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Seen on time\nVery clear and detailed on my history and going forward what’s needed",
    "Date":"24th January 2025",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Mr Sheikh put me at ease and very quickly told me my problem, l am now on waiting lists for tests, excellent treatment, thank you",
    "Date":"23rd January 2025",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Spoke clearly in a professional manner, was understood  very well",
    "Date":"21st January 2025",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Professor Shaikh is warm, kind and friendly. He listened to all my questions and provided me with a treatment options, along with benefits and risks, so that I could make an informed choice on how to proceed.",
    "Date":"18th January 2025",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"After bowl cancer diagnosis, my wife was seen by Professor Shaikh. He offered surgery , in spite of previous and current medical history. The surgery was carried out,with great success. My wife and I are very grateful for his wonderfull ability. and the care and understanding shown by the whole team.",
    "Date":"16th January 2025",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Professor Shaikh always makes you feel as though you’re his most important patient. He listens & explains his thoughts\/opinions well. He is thorough as well as displaying empathy.",
    "Date":"14th January 2025",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Mr Shaikh carried out my surgery and was fantastic all the way through, made sure I wasn’t worried or nervous throughout, made me feel comfortable, he explained what he was going to do and how he was going to do it. He also explained everything and showed me photos during my consultation 6 weeks after my op. I would highly recommend!",
    "Date":"14th January 2025",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I had done haemorrhoidectomy with this doctor. The procedure went very well. It is of course painful for the first 3-5 days and you need to rest but after 5 days I was able to do more or less everything as normal, of course being careful not to lift heavy things and resting to allow body to recover. It would have been beneficial to have more advice from the doctor on nutrition before the procedure and the first 5 days after, also what to expect. The medical secretary of this doctor was super helpful and provided a lot of this information and helped me to get an additional treatment that was needed following the procedure.",
    "Date":"4th January 2025",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":4
  },
  {
    "Review Text":"I have already provided a strong positive reference for Prof Shaikh. This feedback is specifically for his team. While experiencing my first Colonoscopy, I was taken by the care and support from every member of the team I met. \n\nMy speciality is supporting high performance teams. And during my procedure, I experienced the power of being supported by such a team. \n\nOf particular note, the Assistant ODP was just brilliant at making sure I had the right amount of sedation, not more than needed, and enough that I was able to watch the free video feed from inside me. \n\nPlease keep up the good work so others can experience masterly care. \nHave a great Christmas one and all.",
    "Date":"21st December 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"A good doctor who listens to your concerns and acts accordingly",
    "Date":"21st December 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Prof Shaikh is skilled,  competent and caring. I felt very safe in his hands.",
    "Date":"17th December 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Prof Shaikh was extremely efficient. He explained all the options that were available including worse case scenarios. He made me feel at ease.",
    "Date":"16th December 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Professor Shaikh has taken time to understand my issue fully and how this is impacting my life, using this information to recommend appropriate and timely care pathways. Although the medical interventions I have received from Professor Shaikh haven’t solved my issue, the level of professionalism, knowledge, expertise and care given has been excellent.",
    "Date":"13th December 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I had a positive experience with prof Irshad Sheikh . He is an exceptional doctor who has had a significant impact on me. He not only taught me valuable medical knowledge but also offered guidance and support during challenging times. His dedication to his patients and willingness to help others stand out. I deeply admire his professionalism and compassion, and I highly recommend him as a mentor and physician.",
    "Date":"11th December 2024",
    "Category":"Unknown",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"During my clinical placement at NNUH, I had the privilege of working with Mr. Sheikh as an elective medical student from Jordan. I attended numerous theatres, clinics, and ward rounds with him. Mr. Sheikh is an incredibly professional doctor and surgeon, demonstrating exceptional skill in his surgeries, particularly in robotic surgery, where his expertise is remarkable. He is deeply committed to supporting students. His compassionate approach to patient care further sets him apart. I learned a great deal from him, and it was a pleasure to work alongside him. I highly recommend him for any colorectal cancer patients seeking expert care.",
    "Date":"11th December 2024",
    "Category":"Unknown",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"During my clinical placement at NNUH, I had the privilege of working with Mr. Shaikh as an elective medical student from Jordan. I attended many theatres, clinics, and ward rounds with him. Mr. Sheikh is an incredibly professional doctor and surgeon, demonstrating exceptional skill in his surgeries, particularly in robotic surgery, where his expertise is remarkable. He is deeply committed to supporting students, offering valuable guidance throughout my time with him. His compassionate approach to patient care further sets him apart. I learned a great deal from him, and it was a pleasure to work alongside him. I highly recommend him for any colorectal cancer patients seeking expert care.",
    "Date":"11th December 2024",
    "Category":"Unknown",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I had cancer surgery in April 2024. Professor Shaikh was brilliant before, during and after this surgery, allowing me to get back to normal as soon as possible. He was professional and approachable throughout this time. I would recommend him without hesitation.",
    "Date":"9th December 2024",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"He deals with bottoms   , understood my ailment , did a full investigation colonoscopy , I am consider next step , he is not pushy \n\nVery happy",
    "Date":"8th December 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Professor Irshad Shaikh Was extremely helpful and professional. I would not hesitate to recommend him.",
    "Date":"3rd December 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I would definitely recommend Professor Shaikh. He has been amazing throughout my care. I felt very well informed at the consultation, the subsequent colonoscopy at Spire Hospital Norwich went very well. I am an anxious person and was not looking forward to the procedure but Professor Shaikh was amazing, so professional and with a very caring nature. I felt so comfortable during the colonoscopy and knew I was in very experienced hands. Thank you so much Professor Shaikh.",
    "Date":"28th November 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"The doctor outlined all possibilities, explaining my issue in enough detail for me to understand and is organising what I need … what more could I ask for",
    "Date":"23rd November 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"He makes you at ease, has a great sense of humour ,explains everything about any worries you may have. I am so happy he performed my surgery. I trust him completely.",
    "Date":"22nd November 2024",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Due to past major surgery I was developing painful episodes. He not only listened carefully he also showed me the results of a CT Scan. He explained the problems shown and why my problems had occured. He also examined me. His advice was to do with diet and the type of foods etc I should eat. No one in the medical profession from the many years since my operation had advised on diet. He was patient and unhurried. His manner kindly and empathetic.\n\nMy husband was part of all this. Questions and discussions pertinent. I was hoping for reassurance and got it in abundance. I know I can see him should I need help in the future. An amazing and knowledgeable Surgeon.",
    "Date":"21st November 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I felt very at ease during my consultation. I was listened too and offered options for my treatment.",
    "Date":"20th November 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"i met professor shaikh 3 years ago as i was having trouble with my bowel, he recommended i have an operation to have some bowel removed  he went over and above not to give me a stoma bag  he is the most caring nicest surgeon and makes you feel at ease and also has a funny sense of humour . i can not praise professor shaikh enough for all he has done for me ... and gave me my life back thank you x",
    "Date":"19th November 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"He is so professional, detailed with sound communication skills.",
    "Date":"18th November 2024",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Doctor Shaikh was very professional, friendly, caring and was s good listener. The nurse was professional, friendly and efficient. I felt comfortable and looked after by them both.",
    "Date":"18th November 2024",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Professor Shaikh was an excellent specialist to have chosen. He was kind, patient and extremely professional. I had a check up, a CAT scan and colonoscopy, each stage was explained and I felt at ease with what was happening. During surgery, Professor Shaikh and his team were amazing in their care and I couldn't rate them all high enough.",
    "Date":"13th November 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I would like to extend my heartfelt gratitude to Dr. Shaikh for the exceptional care and professionalism during my recent surgery. From the first consultation through the recovery process, I felt confident in their expertise and genuinely cared for.\n\nDr. Shaikh not only demonstrated impressive surgical skills but also took the time to explain every step, ensuring I felt informed and reassured. His compassionate approach and attention to detail greatly eased my anxieties and contributed to a positive experience.\n\nThanks to Dr. Shaikh’s dedication and commitment, my recovery has been smooth, and I am already seeing significant improvements. I am truly grateful for their outstanding work and would highly recommend them to anyone in need of a skilled, empathetic surgeon.",
    "Date":"12th November 2024",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Very nice and humorous person.\nVery knowledgeable in his specialist field.\nCovers all options with discussion.\nOnly fault is he talks very very quickly and sometimes details are lost in conversation, his time is precious so understandable, but could cause concern for more nervous of patients and may help people to feel at ease with more time to digest any issues that may arise.\nOverall a very good specialist and professional.",
    "Date":"11th November 2024",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":4
  },
  {
    "Review Text":"Regarding my rectal prolapse which has been a particular issue for the last three years, Professor Shaikh provided the clearest, most precise diagnosis I have received and a clear description of the available treatment options, potential benefits\/success rates and risks. During my initial examination and subsequent banding procedure, Professor Shaikh was professional but friendly and he and the nurse conducting procedures helped ensure that I felt relaxed and as comfortable as possible throughout. In telephone contact, Professor Shaikh’s private secretary Donna Lorne has been both caring and very helpful.",
    "Date":"11th November 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"A true professional.",
    "Date":"31st October 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I appreciate the doctor's patience and attention. He spend enough time to explain the things and features that are important for me and I have a big relief as I had been horribly nervous before about my health condition. I got some treatment recomendations and hope it also will work! Thank you.",
    "Date":"29th October 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"He was very knowledgeable and very quickly got to the crux of my problem.  He listened to me and took into account my views after ensuring that I fully understood all aspects of my case.",
    "Date":"26th October 2024",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"This is a follow-up to my submission earlier this month. I first met Professor Shaikh twelve months ago in November 2023. The consultation was for a matter unrelated to my pending hernia surgery. At that time, he examined my abdomen and found two irregularities; one was the hernia which is about to be corrected and the other was a palpable swelling which he suspected might be an aortic aneurysm. He immediately referred me for a CT scan. A week later, the scan confirmed that the aneurism was large and a real risk to life. \n\nLater that afternoon, I took two unexpected phone calls; one from a surgical colleague of Prof. Shaikh who assured me that he would see me without delay at his next clinic to arrange surgery and the other from Mr Shaikh himself to check the situation. I was pleasantly surprised that he had taken so much care to look after my interests. Without his involvement, I would have continued my days without realising what a serious risk to health was lurking in my abdomen. It is fair to say that Professor Shaikh has probably saved me from an early death, and I am truly grateful for his concern and professional competence",
    "Date":"22nd October 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"An absolutely brilliant doctor who has helped me through a difficult time, provided excellent advice and a fast service. Would recommend to friends and family.\n\nVery knowledgeable in the field, I am confident that advice and treatments were recommend purely in my best interest",
    "Date":"20th October 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Earlier this week, I had a consultation with Mr Shaikh to discuss the way forward for the correction of a painful inguinal hernia. I was pleased that Mr Shaikh took time to consider the implications of some major abdominal surgery carried out earlier ths year  for an aneurysm and he was very helpful in explaining the alternative options. I shall return to the Spire hospital in December for the surgery to be done.",
    "Date":"19th October 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Dr Sheik has been very accommodating and patient with me taking the decision to have the operation. \nHe made sure to explain the potential outcome well.\nHe made me feel that if I had any concerns that I should feel comfortable to contact him via his (also very nice) secretary.\nI can’t fully recommend him to others as I have not had my procedure yet",
    "Date":"17th October 2024",
    "Category":"NHS",
    "Recommend Stars":4,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Professor Shaikh was extremely professional and personable, he makes you feel comfortable, listened to and involves you in the planning of your care. He answered all of my questions concisely and in a manner that was understandable, I left feeling reassured and confident in the care he was providing me. Sometimes you see a lack of care and empathy in healthcare now due to the pressure and challenges staff face, this could not have been any different with Professor Shaikh, I did not feel rushed in the appointment, he seemed to genuinely care about getting a solution that met my individual needs. I would feel confident for Professor Shaikh to treat any of my family members and let's face it, that is the real test of how you view a health professional. I'm very grateful for his time, manner and expertise.",
    "Date":"16th October 2024",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Mr Shaikh provided great professional care, information and treatment at my assessment. He was very kind, patient and gentle.",
    "Date":"16th October 2024",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Really friendly and informative and answered al my questions to reassure me.",
    "Date":"16th October 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Very understanding and sympathetic to my problems, appointment on time and further investigation offered.",
    "Date":"15th October 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"This doctor helped me feel at ease, he discussed my my condition and demonstrated full comprehension of what was wrong which has given me a high level of confidence in his ability.\nThis doctor is also very friendly and is easy to talk to and also share some laughs.",
    "Date":"13th October 2024",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":null,
    "Date":"12th October 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I had to have an unplanned operation to remove part of my bowel. I was extremely lucky that Professor Shaikh was on duty for it as he is a specialist in Keyhole Surgery (otherwise it would have resulted in a full open surgery with a scar from my breastbone to my groin).  I also didn’t have to have a temporary stoma as he was able to successfully join the bowel so I was extremely grateful for that too. \nI met him just before my surgery and he made me feel relaxed and confident and if I ever needed to have surgery again I would sincerely hope he would be able to do it. Thank you so much.",
    "Date":"12th October 2024",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"He is thorough with investigations.\nI feel listened to as a patient.",
    "Date":"11th October 2024",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Prof Shaikh is first class in his patient care & understanding. He is highly knowledgeable & yet shows great empathy for your wishes. I cannot recommend him highly enough.",
    "Date":"9th October 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"What a great doctor. Knowledgeable, kind, caring and understanding. \nVery nice manner and someone I instantly liked and trusted.",
    "Date":"9th October 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"He was polite & introduced himself but I found him distant, and disinterested.He did not try to engage with me. He just said I see you’ve no appetite, lost weight and got tummy pain - any other bowel problem. I told him yes IBS & Diverticulitis   He asked me to get on the bed, examined my tummy (didn’t ask if it hurt anywhere). Examined my back passage and put a camera up. He said he didn’t see anything to be concerned about and he would organise a scan. \nI was expecting at least a discussion and an opportunity to ask some questions but he just left.\nI said to the nurse - is that it?’ She said I could go.  \nApart from the relief that it’s nothing serious I feel let down that he did not discuss anything with me",
    "Date":"6th October 2024",
    "Category":"NHS",
    "Recommend Stars":1,
    "Trust Stars":3,
    "Listening Stars":1
  },
  {
    "Review Text":"Very quick and sensitive rectal examination. Very clear explanation. Offered options for further examination to suit my needs and preferences",
    "Date":"5th October 2024",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I am a medical student, and was under Professor Shaikh's supervision during my placement at NNUH. He was very attentive with patients and myself, and answered any questions I had. During procedures he would ask questions to keep me engaged. Overall a great introduction to Colorectal Surgery.",
    "Date":"3rd October 2024",
    "Category":"Unknown",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Kind, professional, clear information.",
    "Date":"30th September 2024",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":4
  },
  {
    "Review Text":"Polite and courteous, experienced and understanding.",
    "Date":"29th September 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I was referred to Professor Shaikh following a diagnosis of appendicitis.  \nProfessor Shaikh performed the operation to remove my appendix which went well and I was back on my feet the same day with no pain or side effects at all.\n\nProfessor Shaikh then completed a number of follow ups which identified additional conditions and treatment was then able to be arranged swiftly.\n\nI would highly recommend Professor Shaikh, his attention meant that I was diagnosed and treated swiftly and efficiently.\n\nThank you",
    "Date":"28th September 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Caring, attentive, professional, patient and understanding.",
    "Date":"17th September 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Prof Shaikh was very professional, good at putting my mind at ease for my procedure. Confident in his Diagnoses.",
    "Date":"17th September 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Very friendly and put me at ease, professional and very helpful.",
    "Date":"17th September 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Professor Shaikh is passionate about his area of expertise and very motivated to bring good outcomes for his patients and the profession as a whole.\n I was diagnosed with colorectal cancer in January ‘24 and was offered surgery. Prof. Shaikh explained the process including the fact that he uses robotics during the surgery. This allows greater accuracy and is less invasive than traditional surgical methods. I initially declined the surgery as I wanted to influence my own health and be in a better place to undergo surgery and make a good recovery if required later on.\nI had a bowel resection operation in May which went well and I was discharged onto the virtual ward (self monitoring at home) in 24hours. This was preferable to a longer stay in hospital. I continue to make a good recovery and am cancer free.",
    "Date":"17th September 2024",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Lovely Doctor. Great personality. Very handsome. Nice manner.  Also extremely professional and conscientious. \nOnly one thing: The sedation for the procedure didn’t work. Not his fault as I was all connected up for sedation but it had absolutely no effect on me at all so procedure (colonoscopy) was slightly painful at moments. He did apologise for the discomfort.",
    "Date":"17th September 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I found that Professor Shaikh was very helpful and kind, and understood my problem without me having to go into too much detail.",
    "Date":"14th September 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Prof Shaikh did an excellent job of my challenging surgery and has given me a new lease of life after years of illness. His post-op care was fantastic - he listened to my concerns and took great care of me when I experienced unavoidable post-op complications. I'll be forever grateful for his care!",
    "Date":"14th September 2024",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Irshad, via key hole surgery, has mended my hernias with two meshes. He has clearly done a very good job. I played golf four weeks after the operation",
    "Date":"13th September 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Very pleasant and understanding.",
    "Date":"13th September 2024",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Great care throughout, with friendly and careful explanations both before and after my operation.",
    "Date":"13th September 2024",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Professor Shaikh recently dealt with my colorectal cancer. He performed robotic laparoscopic surgery.  Within a couple of weeks of the procedure life was 90% normal again and now cancer free. I cannot rate my care highly enough. Am so grateful to have had such a good experience despite it being a negative situation.",
    "Date":"11th September 2024",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I was very lucky to be referred to Professor Shaikh and his team following a diagnosis of Colorectal cancer.\nProfessor Shaikh explained the required procedure (high anterior resection) and that it was going to completed robotically, although under manual control.\nOne of the benefits of this is a reduced recovery time & I was able to return home in two days. there were a few small incisions and one slightly larger, these healed quickly.\nI was able to get out and walk the dog in under 7 days still somewhat sore, however this was much sooner than I expected. I understand that traditional surgery would have been much more invasive and the recovery time extended.",
    "Date":"11th September 2024",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Mr Sheikh made me feel at ease, he was able to explain the cause of my symptoms and the investigations that would be carried out, this will enable me to manage my symptoms while waiting for the results",
    "Date":"11th September 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Professor Shaikh has been with me throughout my cancer journey over the last 3 years. He has been a refreshing change to some doctors along my journey as he is straight talking doctor. \n\nUnfortunately, he was unable to undertake my surgery privately at the Norfolk and Norwich University Hospital and so recommended Ian Jenkins from the London clinic, who was an amazing surgeon and save my life.",
    "Date":"10th September 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Prof Shaikh was lovely, friendly and put me at ease. I would thoroughly recommend him.",
    "Date":"5th September 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Dr. Shaikh and his lovely assistant wete very attentive and helpful.  Telling me what could and would be done before during and after, how long and recovery period and pain threshold for after care.",
    "Date":"31st August 2024",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"What an amazing doctor. Really made me feel at ease, valued, cared for etc. \nperfect!",
    "Date":"31st August 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Professor Shaikh was extremely courteous and his friendly, reassuring manner immediately put me at ease. His diagnosis of my condition was explained in a clear and concise manner and the medical treatment I received was first class. I have no hesitation in recommending Professor Shsikh as a skilled medical professional.",
    "Date":"30th August 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Professor Shaikh is so patient focused, he put me at ease through the initial consultation and gave realistic expectations of the surgery and recovery which made the experience seamless.\n\nI was prepared for the pain post surgery which was difficult, but knowing this would be the case for the first week meant that I could prepare home life to accommodate for my needs.\n\nThe post surgery consultation was also well organised and ran to time. \n\nI cannot rate Professor Shaikh highly enough",
    "Date":"29th August 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I came today to see Prof Shaikh, as soon as he greeted me in the waiting area I felt immediately at ease, he listened to my problems, performed an examination and all the while maintained a great bedside manner. I was kept informed throughout the consultation, and things explained clearly to me. He has a good sense of humour which helps ease any nerves. He was honest about the procedure I will need, and even with being told about the painful recovery period, I have full confidence in Pro Shaikh. I came away feeling confident and glad that finally things are going to get sorted.",
    "Date":"28th August 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Very good colleague. Excellent knowledge and skills.",
    "Date":"20th August 2024",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Perfect doctor",
    "Date":"20th August 2024",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I recently had an inguinal hernia repair. I felt completely at ease after initial consultation. After my op Professor Shaikh came to see me before I was discharged the same day.  I had my follow up visit yesterday and he carefully listened and answered any questions I had.\n\nHe had a very warm approach and instilled great confidence giving me very detailed and useful information from beginning to end.",
    "Date":"18th August 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"From my first consultation to the final checkin, the Professor was professional, explained everything thoroughly including post-operative conditions.\n\nThe operation itself went very well, and as the Professor had explained (but i did not quite believe!) there was some very ‘interesting’ bruising below where the hernia was, which has slowly cleared up.\n\nI felt in very safe hands throughout, and would highly recommend the Professor.",
    "Date":"17th August 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I was referred to Prof Shaikh following some anal bleeding after a heart bypass graft. He examined me , gave me some treatment , and gave me various options so I understand what I need to do.\n\nI found him very open, honest and informative. I trust his advice",
    "Date":"15th August 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Consultant for a same day procedure.  Professor Shaikh explained the indication for the procedure and advised me of side effects to keep a lookout for",
    "Date":"15th August 2024",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Patient, listened to my concerns, reassuring.\nExplained clearly to me what further investigations were required & involved.\n\nI would have no hesitation in recommending this Doctor and his care.",
    "Date":"15th August 2024",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I recently visited professor Irshad Shaikh, I presented a complicated problem,  After examination he put my very stressed mind at rest, He explained to me what my problem was, and in detail how he was going to mend me, relieve my uncomfortable feeling, and try to reduce my pain, I found him very knowledgeable and a great help to me. I can’t see a way to improve the whole service, from a beautiful building, very helpful reception and nursing staff, I really found no fault, I would highly recommend this establishment.",
    "Date":"14th August 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Listened well and gave good explanation to questions asked. Agreed to deal with my issue.",
    "Date":"7th August 2024",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Had my first appointment today, as had on going Abdominal dull pain and having to wait 14 weeks for a colonoscopy on the nhs I decided \nTo go private. After a in depth talk about my history and how I’ve been feeling, he performed a rectal examination, I felt very comfortable as he put me at ease and very professional, I’ve been referred for extra tests to investigate further. As someone that suffers with high anxiety, he has really put my mind at ease. Professional and a great sense of humor.",
    "Date":"7th August 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Professor Shaikh was friendly, professional and informative. I am very nervous in any medical environment and he did his best to make me feel at ease.",
    "Date":"2nd August 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I have only so far had an initial consultation & examination. I have an ongoing musculoskeletal condition, which is also now effecting my bowels. I was impressed by the Dr's understanding of my complicated issue's. I was given clear details of options to help with further diagnosis & move forward to rehabilitation.",
    "Date":"31st July 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Spent the time making sure I was listened to, walked me through what was going to happen.",
    "Date":"30th July 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Prof Shaikh was kind, helpful and informative. He also actually listened to what I was saying, taking into account my worries and wishes. He helped me to understand what may be wrong and did not dismiss my symptoms or concerns.",
    "Date":"25th July 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Very caring and understanding of my problem",
    "Date":"24th July 2024",
    "Category":"Unknown",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I had a very good experience with this doctor during my initial appointment to discuss the procedure. The doctor was very knowledgeable and very caring, the examination performed was done with great dignity and care. I was given plenty of chances to ask questions and was given information I needed to consider my treatment options.",
    "Date":"23rd July 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I needed a second opinion as to treatment options following rectal cancer diagnosis. Professor Shaikh took me through the potential outcomes both positive and negative in a concise and considerate way.  At the end of the consultation I felt enabled to make a considered decision as to which treatment option I would prefer.  I cannot commend his understanding, sympathetic manner and professionalism highly enough.",
    "Date":"23rd July 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Very thorough appointment, went into great detail to explain my symptoms and diagnosis. Didn’t feel rushed and left with more knowledge and understanding. Great doctor and fantastic experience using spire.",
    "Date":"23rd July 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"All very good.",
    "Date":"22nd July 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Prof Sheikh was put in an difficult position with the GP refering me for a lump in my stomacht 2weeks earlier but then 12days ago I had major Kidney problems that the N&N addressed drained 4ltrs out of my bladder  and my lump disappeared. Plus my SIP Test came back negative so there is no actual bowel problem.",
    "Date":"19th July 2024",
    "Category":"NHS",
    "Recommend Stars":4,
    "Trust Stars":4,
    "Listening Stars":4
  },
  {
    "Review Text":"Very professional, thorough, and friendly.",
    "Date":"10th July 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I was very impressed overall on how Prof Shaikh assessed the information I provided and the thorough examination that was carried out, which was the first undertaken in the six months in trying to identify the cause of the pain.\nHe was very clear in his explanations and used analogies to help explain the medical terms which I found reassuring in understanding the condition.",
    "Date":"9th July 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I had a good experience, the best healthcare I have received to date.",
    "Date":"8th July 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Specialist listened, reassured and consulted with me to find the best treatment for me.",
    "Date":"3rd July 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I have had four appointments with Professor Shaikh, over the past year, having been referred to him by another consultant; I had been having regular scans and it was noted that I had a swelling on my appendix. \nOver the past year, the situation has been monitored and I have had several discussions with Professor Shaikh about what should be done. He has been highly professional and very helpful. He took the time to explain the options to me very carefully and in a way which was easy to understand. He gave advice and allowed time for me to ask questions, which he answered fully. From there, we decided a way forward, together.\nHe advised that I would need an option to remove my appendix.  However, I was overweight and he explained very clearly the risks posed in surgery by the extra weight I was carrying.\nI am very grateful to him for providing me with a clear focus and, following his advice, I began dieting; so far, I have lost 15 kgs. I will see Professor Shaikh in December when I hope to have lost another 5 kgs. I feel so much better and, already, I have a great deal to thank him for.\nWhen we meet again in December, we will plan the operation I need and I shall go into that knowing I have done everything I can to reduce the risks, thanks to his advice and support. \nI have the utmost confidence in Professor Shaikh and I have no hesitation in recommending him, unreservedly.",
    "Date":"1st July 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I was diagnosed with early stage bowel cancer in December 2023. By February 2024 I was in the Norfolk and Norwich university hospital being operated on by Professor Shaikh using a robotic anterior resection.\nThe operation went very well and I was discharged 3 days later. \nProfessor Shaikh explained the process and the likely after effects. The only setback was an infection that took a few weeks to clear.\nUndoubtedly early detection through the annual bowel screening test snd prompt surgery prevented me from needing more drastic surgery snd chemotherapy.\nI consider myself very lucky and am extremely thankful for the great care given by professor Shaikh and the team at the NNUH.",
    "Date":"29th June 2024",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I had a fantastic time with Prof Shaikh during my medical elective at NNUH. I’ve had the opportunity to see him operate and I can say that he is exceptionally skilled with his robotic colorectal surgery and at the top of his field. He is also very knowledgeable, a passionate teacher and was very eager to help plan my days. I highly recommend doing a student exchange with Prof.",
    "Date":"27th June 2024",
    "Category":"Unknown",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"This Doctor was part of a team that saw me on a Sunday afternoon. He had come to work on his day off as part of a programme to clear the backlog. I am grateful to him.\nHe explained my treatment options clearly and patiently worked with me while I went back and forth. I was impressed by his patience and his willingness to listen.",
    "Date":"23rd June 2024",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I felt listened to and that I was provided with an honest opinion.",
    "Date":"22nd June 2024",
    "Category":"Private",
    "Recommend Stars":4,
    "Trust Stars":5,
    "Listening Stars":4
  },
  {
    "Review Text":"Honest opinion",
    "Date":"18th June 2024",
    "Category":"Private",
    "Recommend Stars":4,
    "Trust Stars":4,
    "Listening Stars":4
  },
  {
    "Review Text":"What a wonderful doctor.  Very friendly and down to earth.  Put us an easy immediately.  Asked a number of questions which were relevant to our visit without baffling us with medical terminology.  After his examination talked us through the options available without any pressure to commit.  We left feeling very positive and confident that should we decide on any of the options we would be in excellent hands for further treatment.",
    "Date":"11th June 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I can’t say enough  about Professor Shaikh , he put me at ease the minute i met him and told me in plain terms what my treatment would be, and on the day of my opparation he was very kind and put me at ease , i would recommend him to anyone.",
    "Date":"11th June 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I have been totally satisfied with all of my dealings with Professor Sheikh and his very helpful team.",
    "Date":"11th June 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Really clear and helpful teaching, interactive teaching and engaging. Ward based discussion was very helpful for learning.",
    "Date":"10th June 2024",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Great teaching session on colorectal cancer and stomas. Everything was explained really well!",
    "Date":"10th June 2024",
    "Category":"Unknown",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Was very nice to meet with Professor Irshad Shaikh today. He explained the surgery and procedure well and I feel very confident in going forward with my operation.",
    "Date":"8th June 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Obviously knowledgeable. Clear explanation of the treatment options and possible side effects.",
    "Date":"30th May 2024",
    "Category":"Private",
    "Recommend Stars":4,
    "Trust Stars":4,
    "Listening Stars":4
  },
  {
    "Review Text":"I am still in the early stages of complete diagnosis but so far all my dealings with Professor Sheikh have been very positive.",
    "Date":"29th May 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Prof Shaikh came across as very experienced, caring and compassionate.  He explained the pros and cons of my treatment plan really well and explained more about my condition in easy language and I left my last appointment feeling more positive than before.  \nI have no negative comments.",
    "Date":"23rd May 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":4
  },
  {
    "Review Text":"I have seen Prof Shaikh twice for haemorrhoids, and on both occasions he has been helpful and thorough, suggesting the most appropriate (and cost effective) approaches to management and treatment. I have also found his secretary, Donna Lorne, to be very helpful.",
    "Date":"22nd May 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Great session",
    "Date":"9th May 2024",
    "Category":"Unknown",
    "Recommend Stars":4,
    "Trust Stars":4,
    "Listening Stars":4
  },
  {
    "Review Text":"Great teaching on surgical anastomoses. Very useful explanations and videos which will be very helpful when reporting post operative cases.",
    "Date":"9th May 2024",
    "Category":"Unknown",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I was extremely pleased to have Professor Shaikh as my surgeon. He treated me for my inguinal hernia and thanks to his care and the team at NNUH I am looking forward to picking up my sports and gardening which had become limited before my surgery. \n\nI felt that Professor Shaikh kept me fully briefed regarding my options and the associated risks providing me with a lot of pre and post-operative information.\n\nI would certainly recommend him to anyone considering similar surgery.",
    "Date":"7th May 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I can highly recommend Professor Shaikh",
    "Date":"7th May 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I have had 2 procedures with Professor Shaikh, both of which have been carried out with care and professionalism. I will also commend him and his secretary who helped with giving me information and sorting any concerns I had afterwards in a timely manner.",
    "Date":"30th April 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Doctor who knows his patients well and takes the time to listen to their stories.",
    "Date":"24th April 2024",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Professor Shaikh and his team were very efficient and knowledgeable and explained everything in great detail to reassure me of the procedure and next steps. \n\nAs a very nervous patient, I was extremely grateful that he managed to see and remove my very small polyp - reducing the likelihood of further issues. \n\nThank you.",
    "Date":"6th April 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I had a private consultation with Professor Shaikh and was greatly impressed by his knowledge of developing robotic surgery and how this could apply to my condition. He exuded an enthusiastic manner and answered my questions, reassuring me that with my general level of fitness and diet the operation shouldn't prove to be a major issue. I left the consultation with a feeling of complete confidence and that this surgeon would be the one to operate on me.\n\nAfter the operation, Professor Shaikh took the trouble to visit the ward to have a chat about the operation and to assess how I was feeling. Shortly before my discharge, he happened to come over again and said that because my blood-haemoglobin levels were rising, I could be discharged the follow day.\n\nMy advice to other potential clients of Professor Shaikh would be to think through the operation trying to visualise what is going to happen, and the issues arising from it and to frame your questions accordingly. I wrote to his NHS secretary before the operation with a list of questions and these were answered promptly. In addition, have questions ready during post-operative recovery even if they amount to something simple and obvious. With answers you can plan the next few weeks without there being any surprises: knowledge is power.",
    "Date":"5th April 2024",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Professor Shaikh is extremely professional & thorough whilst at the same time being very friendly & was able to put me at ease instantly for an appointment for which I was a little anxious. I was very confident in his abilities & felt in extremely capable hands. I ‘look forward’ to our follow-up!",
    "Date":"27th March 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Professor Shaikh, made me feel very comfortable and at ease in the appointments and the procedure I had.",
    "Date":"22nd March 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":4
  },
  {
    "Review Text":"Really great teacher. Very knowledgeable and engaging - even knows about the Moskowitz artery.",
    "Date":"20th March 2024",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Great bedside manner. Reassuring and comforting. Offered sensible advice and was happy to answer questions. Very satisfied.",
    "Date":"16th March 2024",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Following the discovery of a cancerous polyp in my bowel I was referred to Professor Irshad Sheikh who was perform a bowel resection procedure.\nAt my pre op review I met Mr Shaikh and he explained very clearly what to expect and what I needed to do to prepare for my procedure.\nHe explained that my procedure would be performed using a robotic system which would ensure speedier recovery with less pain than the usual manual procedure.\non the 13th of November 2023 I had my procedure at the Norfolk & Norwich University hospital.\nI was allowed home the next day although feeling a bit tender my pain level was low and treated with paracetamol and nothing stronger.\nHaving followed Professor Shaikh's post op instructions I was able to return to work as gardener\/painter and decorator (which is quite physical) as soon as the end of January 2024.\nEverything has been absolutely fine since my return to work with no pain of anykind.\nI can say that although worrying at the time my experience of this procedure relatively pain free with no post procedure issues and feel fine.",
    "Date":"14th March 2024",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Very professional \nI didn’t feel any discomfort \nVery helpfull",
    "Date":"9th March 2024",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Professor Irshad Shaikh and Lana were absolutely lovely. They did theirs absolute best and made me feel very comfortable! I’m am so grateful to be treated by such lovely and professional people. Their support, kindness and positivity made my day. Please pass on my thanks! I’m very grateful for the support have received and am receiving.",
    "Date":"9th March 2024",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"We have to trust the doctor’s decision of what is the best for us, confidence goes with trust, so making one feel comfortable talking about bits of one’s body it is easier to show no one is important!\n\nMaybe when asking if one has had abdominal surgery reminding one that this can include sterilisation. I certainly could have helped with past history if nudged.",
    "Date":"9th March 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":4
  },
  {
    "Review Text":"Very kind, honest and respectful",
    "Date":"9th March 2024",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Professor Shaikh has been excellent throughout treatment, leading through the options and explaining everything thoroughly. His confidence and manner puts you at ease.",
    "Date":"5th March 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"after suffering with bleeding internal  hemeroids i was seen by professor shaikh, was given clear and  straight to the point information . booked in for surgery a lot sooner than expected, which has turned out to be very successful   many thanks   professor shaikh and your team",
    "Date":"5th March 2024",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I came in today for a consultation with professor shaikh and his team, very welcoming and assured me that what we were doing today was going through my symptoms and past history. Very helpful and very professional throughout my visit, and told me exactly what needed to know, and definitely put my mind at rest. Looking forward to getting this procedure done. Very pleased with the whole experience.",
    "Date":"17th February 2024",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Very quick appointment as got it within a week of speaking to the nurse at my surgery.",
    "Date":"17th February 2024",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Much appreciated in his medical advice, explained everything and was willing to listen and give all the options.",
    "Date":"17th February 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"My appointment came through sooner than I expected. Efficient and comfortable reception area. Was seen promptly. Professor Shaik had read the notes and knew why I was there. Examination was thorough and careful and sensitive to my discomfort. The outcome and follow up treatment was explained fully. I am confident that my condition has been properly assessed.",
    "Date":"17th February 2024",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Professor Shaikh put me at ease, he was very knowledgeable and funny.",
    "Date":"15th February 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I attended a follow up appointment with Professor Shaikh, following a colonoscopy with the great team at the Quadrant Institute.  He was professional, and kind, with a sense of humour and offered to refer me for a scan.",
    "Date":"15th February 2024",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"My operation (robotic surgery) was undertaken by Mr Irshad Shaikh and his team on the afternoon of 10th May 2023. Once in the operating theatre where given anaesthetic, it felt like only a few seconds until I was unconscious. In the evening, I came round in a bed in the ward. Not very with it, but I do remember that I was expecting to feel more pain, but there was little. Being able to administer pain killer as required was straightforward (although once given an extra dose by a physiotherapist by mistake, who pressed the dispenser button in error, but no harm done). Staff were excellent throughout.\n     The intention was to be discharged within 48 h but this ran on into Saturday (mainly as no one at home to help look after me on Friday). On Saturday morning (when definitely feeling well enough & wanting to leave) departure was in the afternoon due to delays completing discharge papers, simply due to the volume of work being dealt with by the doctors\/consultants and nurses at the time. I was picked-up by a friend and driven home on Saturday afternoon. Nearby friends were on hand (a phone call away) Saturday onwards (in case an emergency lift was required to hospital). Sunday morning a friend came round and cooked lunch and dinner, and I was gingerly able to walk about (including up and down stairs). \n     Friends did shopping for me for the first 2 weeks or so, subsequently I quickly became more mobile (out for regular short walks and taken shopping). I was able to drive to my Mum’s house (a distance of 134 miles) at the end of July.\n     Thus overall, my experience was very positive and I felt at ease with Mr Shaikh. I was surprised at how rapidly I became relatively fit again and the speed at which my wounds healed (only a minor problem with one incision that oozed a little; given a 1-week dose of antibiotics by GP and healed up within a few days).",
    "Date":"13th February 2024",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":4
  },
  {
    "Review Text":"Professor Shaikh was extremely professional and caring from the moment we met him to the moment he gave us the diagnosis.\n\nHe explained his findings and the options available to us going forward in a caring and informative way and arranged follow up test as required.",
    "Date":"13th February 2024",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"My consultation with Professor Irshad Shaikh was constructive, informative with the manner of a doctor who cared for my welfare. Mrs J King with thanks",
    "Date":"11th February 2024",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"My consultation was very professional and caring. Professor Shaikh asked relevant questions about my past history and current condition, examined me and has referred me for CT scan.",
    "Date":"10th February 2024",
    "Category":"NHS",
    "Recommend Stars":4,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I first met Professor Shaikh following a routine colonoscopy when I was unexpectedly diagnosed with bowel cancer.\n\nThe diagnosis was a complete shock to me and his style in delivering the news suited me.\n\nHis follow up consultation was clear, concise and covered all the questions I had about the diagnosis, treatment plan and recovery.  He was very positive about the potential outcome which has been good.\n\nI was fortunate to be able to have surgery followed by a virtual nurse, which meant I was discharged within 24 hours and my recovery was at home with the support of the virtual team which made everything more comfortable. \n\nProfessor Shaikh has been professional, supportive, frank & honest throughout for which I'm grateful.",
    "Date":"7th February 2024",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I was seen as a private patient at Norwich Spire hospital.\nImpressed that Prof.Shaik enjoys his job.\nNo complaints.",
    "Date":"7th February 2024",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":4
  },
  {
    "Review Text":"Having been diagnosed with a rectal rumour, I did my research and asked if I could have my surgery performed by Professor Shaikh.  Because of where the tumour was located, I felt he could make the difference between having a permanent, or even temporary, stoma post surgery and keeping a more normal bowel function.  I also felt he offered me the best chance for survival going forwards.  My consultation with him was very detailed, but was also very relaxed and humorous at times, which immediately put me at ease.  He explained my diagnosis and the results, gave me 3 options for treating it, the various risks associated with each and his recommendation, which is what I opted for.  This was a robot assisted, laparoscopic anterior resection where the rectum would be excised, as well as the surrounding lymph nodes, and the remaining ends joined together.  I left that consultation feeling so positive.  He instilled confidence.  I had no doubts.  I was given a wealth of information, by the colorectal nurse, to take away with me, which gave more information about the procedure, support networks, what to expect leading up to surgery, post surgery etc.  The surgery took about 5 hours and I was discharged the next day and went onto a 'virtual ward' for the next 11 days, for post operative care.  This service was amazing and it was so much nicer to be recovering at home.  Within the week I was managing to walk around the block, within 3 weeks I had my first meal out in a restaurant and could eat and drink most things again.  There has been a general feeling of discomfort when gas builds up, and slight discomfort when sitting, due to the healing processes taking place, but these are slowly improving with time.  One feature of this whole process, that was really beneficial, was the availability of the colorectal nurse team to answer any queries or concerns that I had pre and post surgery, as they occurred.  The great news is that I don't need any further treatment as the tumour has been completely removed and, on analysis post surgery, there was no sign of spread into the lymph nodes.  I'm so very grateful to Professor Shaikh and his wonderful team for their great skill, professionalism and for giving me my life back.",
    "Date":"1st February 2024",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Professor Shaikh was both friendly and efficient in dealing with me.\nHis treatment was very effective and improved my quality of life significantly.\nHe was always clear explaining options and outcomes.\nThe treatment path we selected was the best choice for me.\nI am very grateful for Professor Shaikh's advice and treatment.\nI have no hesitation in recommending him as a talented medical professional.",
    "Date":"23rd November 2023",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I was very satisfied with my consultations with Professor Shaikh. \nEach time, I left completely  happy that he’d listened to me and made sure I fully understood my options. I also had a little chat and laugh with him which also helped me relax.",
    "Date":"13th November 2023",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"My experience with Professor Shaikh was very positive from the first consultation. All my options were clearly explained regarding the possible pros and cons of various operational options. Professor Shaikh has a very pleasant manner making me feel completely at ease. Professor Shaikh secretary Donna was also very efficient and helpful organising the details leading up to the operation and nothing was to much trouble. The whole process was positive from start to finish.",
    "Date":"27th October 2023",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Professor Sheikh is an excellent doctor and surgeon, when you first meet him he puts you at ease, listens and thoroughly explains what he suggests is the best course of treatment. I have been suffering for years with a condition which I found very unpleasant and which meant going to the toilet could be painful and leave me with an embarrassing  itch.\nAfter a small procedure by Professor I now have total relief.\nI highly recommend him.",
    "Date":"17th October 2023",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Mr. Shaikh was both professional and caring. He gave me detailed information about my condition and prognosis, laid out choices clearly and acknowledged my input and final decision.",
    "Date":"13th October 2023",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"My experience with Mr Shaikh was nothing but positive, made me feel very at ease with the process and he was very informative about what was going to happen, running through possible options and making sure i was happy. Being very nervous going into the operation, he made me feel very at ease by making my laugh and that helped me alot. Many thanks for eveything Mr Shaikh.",
    "Date":"10th October 2023",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Dr Shaikh was incredibly helpful and diligent. His care was second to none and it’s not over the top to say that his help has truly changed my life for the better. Thank you for all your help over the last year",
    "Date":"10th October 2023",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"On the 19th January 2019, I presented myself to A & E following days of abdominal pain. I had a history of bowel problems going back to 2007, & I was quickly admitted to hospital. After extensive examination on 22nd January, I went under what I now know was a Hartmann's Procedure.\n\nIt wasn't until after the operation that I met Mr Shaikh, who carried out this very long & difficult operation. During the rest of my stay, I got to know him from his daily visits & his friendly & attentive reassuring explanations of what had taken place. \n\nMy recovery was good, & my routine visits to see Mr Shaikh have increased my confidence & respect. Having this confidence in your surgeon is so important, before & after surgery, & Mr Shaikh achieves this totally. \n\nIt is now nearly 5 years since the operation, & I would like to thank Mr Shaikh for almost certainly saving my life.",
    "Date":"7th October 2023",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Irshad was very helpful, empathic and informed me about all that was due to come. Irshad made my experience very comfortable, and put me as ease.",
    "Date":"2nd October 2023",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":4,
    "Listening Stars":5
  },
  {
    "Review Text":"Was listed to, thorough examination, great feedback.\nHighly recommended this consultant.",
    "Date":"19th September 2023",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Before my consultation for my bilateral inguinal hernia surgery I was worried about it getting worse. I knew it could worsen but obviously had no idea of when. My situation made me very inactive and I lost sleep. Although right from my initial consultation Mr Shaikh put my mind at rest. Very informative. Explained he would attempt key-hole surgery for both hernias (repairing 2 hernias in one operation) but if it was not possible during the procedure he would revert to open surgery and only repair the larger hernia of the two, as open surgery for both would result in too painful recovery. For me, Mr Shaikh made keyhole work perfectly for both hernias. Easy to speak with and great at explaining the process. He said he's not a god but, in my opinion he comes very close. Also has a great sense of humour, which helped in putting me at ease. Explained the surgery risks on paper and also the minimal negative outcomes he'd seen his patients experience during his career and made a clear contrast between the two. Answered all of my questions at my follow-up appointment. Above all, he safely got me back to the stage I was at before my hernias occured which at this particular stage of my life, meant the world to me. My surgery was on 26.05.23 and I managed my recovery without any medication whatsoever and I have had no recurrence and have had minimal pain, which has got progressively better as each day passes. Explained to me it could be 6 months before my occasional twinges return to normal. \nTo anyone worried about the concept of surgery, like I was, Mr Shaikh has your back.",
    "Date":"14th July 2023",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I decided to book a consultation with Mr Shaikh following several years of anal discomfort.  Prior to this my GP diagnosed an anal fissure and this was followed by a Botox injection, which did give only short term relief.  On initial consultation with Mr Shaikh an anal fissure was not apparent (thank goodness).  He did explain the various options for me in a very clear understanding manner.  Resulting in a colonoscopy, at which time he found various sized polyps within the bowel, these were treated and proved to be non-cancerous.  My next appointment is in 6 months for a review and I am pleased to say I am now pain free.  Mr Shaikh explained everything in great detail and put my mind at ease about any procedures.  He also has a great sense of humour when talking about bottoms, which most people are embarrassed about.  Excellent surgeon.",
    "Date":"9th July 2023",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I was referred to see Mr Shaikh to investigate and discuss my 4th degree haemorrhoids brought on by years of IBS. Throughout each step of the process Mr Shaikh was professional, open and honest regarding all options available. He presented all choices available, as ultimately it was my decision which course of treatment\/surgery to proceed with, there was no doubt in my mind that when a procedure is described as ‘the gold standard’ then that’s what to choose and after having been through it I can honestly say he was completely correct. \n\nOn recovery from very successful surgery, Mr Shaikh followed up with additional investigative work to ensure there was nothing ‘lurking’ which might present future issues. \n\nAll meetings with Mr Shaikh were prompt, informative and in good humour (especially considering the nature of the issue). I would recommend Mr Shaikh without hesitation.",
    "Date":"9th July 2023",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Mr Shaikh was my consultant to treat a fistula and he performed an operation to insert a seton. He was superb at every stage - considerate and set out all the options available to me during the consultation; he was reassuring before and after the procedure. I have every confidence in his ability and judgement. The procedure has transformed my quality of life. I now have decisions to make about whether to continue my treatment on the NHS or continue private treatment, and once again, Mr Shaikh has been completely straightforward in communicating my options.\n\nMr Shaikh is humane and professional - I could not recommend him more highly.",
    "Date":"10th May 2023",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Very concise and to the point. Conscientious and caring. All this from one 45 minute consultation. We really knew what to expect before attending, but at this stage don't want to leave any stone unturned.\nWe believe Mr Shaikh had made the decision not to operate within a few minutes, but still took the time to carefully explain why he arrived at that decision. In words that we could understand!\nA very likable and approachable consultant that handle the situation very well.\nWouldn't hesitate to recommend him.",
    "Date":"19th April 2023",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"A small tumour was found some 30 months ago; surgery followed leaving me with a stoma bag. Re-section followed eight months later. Mr Shaikh's advice, prior to the re-section that normal bowel function would take time and in some instances, might not occur was helpful to me in managing my expectations post procedure.\n\nIn the event, it has taken some fifteen months to feel and enjoy a degree of normal confidence and I have recently returned from a cross-country skiing holiday thanks to skill of Mr Shaikh and his team",
    "Date":"28th February 2023",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Dr Shaikh was friendly and informative, the consultation was comprehensive and I felt very comfortable and relaxed. Everything was explained clearly, and I was given the opportunity to ask questions. I was provided with additional information to take away, which I found useful. I would be delighted to see Dr Shaikh again, I let the appointment feeling confident about my care.",
    "Date":"8th February 2023",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Mr Shaikh took time to explain everything and was also very efficient and thorough when he did the colonoscopy. \nA lovely, approachable man who really cares about his patients.",
    "Date":"7th February 2023",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I had an operation to remove part of my bowel following a diagnosis of bowel cancer as a result of regular screening. My consultation with Mr Shaikh was arranged very quickly after the diagnosis and he took time to explain the procedure thoroughly and also to respond to any questions, or queries from myself or my husband.  He has a very approachable manner which helped to calm my anxieties to some extent.  The operation was performed by robotic surgery which meant I had minimal scarring for what was a fairly big operation.  I had three nights in hospital following the operation during which Mr Shaikh, or a member of his team, visited on a daily basis. I had never had a major operation before so didn't know what to expect with regards to the effect on my body. However, after the first 10 days, or so, when I had to take things carefully,  I was surprised how quickly I was able to get back to many of my usual activities like walking and yoga and my recovery has continued to progress well since then.",
    "Date":"12th January 2023",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I found Mr Shaikh approached my hernia repair in an open and matter of fact manner. In my first consultation he went through the risks and informed me that he intended to attempt the repair using key whole surgery. My appointment for surgery came through quickly and seemed to me to go smoothly on the day. Mr Shaikh informed me later that the key whole surgery had been harder than expected due to a previous operation I had had. My hernia repair was a success and I recovered quickly without pain.",
    "Date":"12th December 2022",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Mr Shaikh performed surgery after I suffered a complication related to my Crohn's Disease of the terminal ileum.\n\nI spent several months in hospital due to a infection abscess caused by a perforation in my bowel. I was extremely unwell and also caught COVID whilst on the ward. Mr Shaikh and I agreed that it was best to wait until I had recovered before surgery was performed. Mr Shaikh took time to ensure I had all the relevant information and understood the pros and cons of having emergency surgery versus coming back at a later date. I was kept informed and involved in the decision making process throughout.\n\nSix weeks ago, Mr Shaikh performed a resection of the terminal ileum. I was very upset at the thought of a stoma and had pleaded for this not to happen. Mr Shaikh advised he would do his best but took time to prepare me for the likelihood that this would happen. However, it was clear that he had really listened to me and understood my wishes and my concerns.\n\nMr Shaikh performed the resection using robotic surgery, and I was thrilled to find that a stoma had been avoided. It is very clear that this was not an easy task. The scarring was very minimal, which was really surprising given the complexity of the surgery performed. \n\nI became poorly a few days after surgery and later discovered that Mr Shaikh had come in on his day off to check on me and to ensure that he was involved in any decisions that may need to be taken around going back into surgery. This demonstrates the level of care shown, going above and beyond to ensure my needs and wishes were met. Luckily further surgery was not needed.\n\nMy recovery time was significantly lower due to the use of robotic surgery and my bowel is recovering well. I'm aware that the surgery was very challenging and am eternally grateful to Mr Shaikh for doing everything he could to ensure the best possible outcome, rather than taking the quickest and easiest route. Throughout the whole process I received first class care from Mr Shaikh and his team and I can't thank him enough for giving me my life back.",
    "Date":"6th December 2022",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I was feeling very frustrated on a long NHS waiting list for a stoma reversal when I met Mr Shaikh privately. He was excellent and made considerable effort to arrange the operation at the Spire Hospital (I believe I was one of the first patients to have this procedure at this hospital). \nThe surgery was a success and the external scar is very neat. The procedure was very good value for money considering the vast improvement to my quality of life.\nI have every confidence in Mr Shaikh who is a skilled and knowledgeable surgeon. \nThe whole team at the Spire Hospital were wonderful.",
    "Date":"26th September 2022",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Mr Shaikh fitted me in at the end of his surgery for an immediate in house minor procedure. He listened to me and helped me on the day so I immediately felt more comfortable and therefore was able to immediately recover from what otherwise  would have been several weeks of discomfort. Both he and the nurses extended their working hours to help me and that is priceless.",
    "Date":"21st September 2022",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I had my consultation with Dr Shaikh in July 2022 regarding horrendous discomfort with internal and external haemorrhoids which I had experienced for a number of years.  In the first instance Dr Shaikh made me feel at ease and talked through in detail, which wasn’t in difficult medical terms, but was simple and easy for me to understand. He gave me a number of options and explained what he felt would be good for me and what would help me lead a normal life again.  He explained it would be my decision as to what procedure to go with and when I chose to have the haemorrhoidectomy  procedure, Dr Shaikh was completely honest with what would happen and also with the recovery, which wasn’t going to be easy.  I am not great in hospitals which I explained to Dr Shaikh and I would be forever grateful for the honesty when he explained that it would be very painful for a good 4-6 weeks whilst I was recovering.\n\nOn the day of the surgery, Dr Shaikh came and saw me and the moment I saw him, I felt at ease as I knew I was in good hands. Following the surgery, he came to see me again to make sure I was ok.  \n\nThe first week I was on a lot of pain meds so didn’t really experience too much pain but by the second week and after a bowel movement, Dr Shaikh was absolutely right in that it would be very painful. But as he explained it to me in detail at the consultation it was not a shock to me, however the pain was real! 4 weeks on and I am over the hurdle of the pain and on my way to living my best life !  \n\nI am so glad Dr Shaikh was my consultant and even more glad that he was completely honest about the surgery and the recovery. Although it was extremely painful and I hope I would never have to have it done again, I would highly recommend this surgery to anyone who has been suffering in silence for years, because I am just so happy that I am not living with the pain and discomfort I had been living with for many years. \n\nAnd if you are lucky enough to have Dr Shaikh as your consultant, you are definitely In good hands ☺️ \n\nAs a final note, I would also like to add how fantastic and extremely helpful his PA - Donna was too. If you have any questions or anything you need to know, then make sure you speak to Donna. She is absolutely super and the most friendliest person I have spoken to.",
    "Date":"6th September 2022",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I had a  Left Hemicolectomy by mr shaikh they said he was the best I believe he is . I had robot key hole surgery no scars I back work lifting glass windows 9 weeks later never would thought I been through opp . Mr shaikh talk about everythink about the opp I understood  .he came every day to see me how I was doing 5 days I was in hospital the nurse s and all the team so good . I so thankful to mr shaikh save my live and the team nurse s the NHS so good my shaikh removed a  cancer tumour from my bowel which I never knew I had thank u to nhs for sending me a poo test kit I would not be cancer free it would be to late if I waited so test kit was brilliant the follow up opponent was very good mr shaikh made me at ease he joke about made me feel better made me not worry .i own my Life to mr shaikh thank u so much mr shaikh and nhs and all the nurses so great",
    "Date":"29th August 2022",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I was referred to Mr Shaikh early in May 2022 for treatment of a tumour in my bowel. He gave me two options which he explained in great detail, this resulted in me choosing to have an operation. As a result of me having been anaemic for many months the previous year and generally ignored by my local surgery Mr Shaikh operated two weeks later. The care and kindness shown my Mr Shaikh and his team was second to none. I made a quick recovery from the surgery due to the confidence Mr Shaikh and his team gave me, they visited me each day whilst in hospital to make sure I was progressing.  I cannot believe what I have had done words cannot express how I feel. I am on cloud nine and it will be a long time before I land. Thank you Mr Shaikh, Donna and the rest of the team.",
    "Date":"11th August 2022",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Seen by Mr Shaikh who found and removed six polyps, three of which had the potential to in time be cancerous. I found him to be excellent, not least as I was an extremely nervous patient. Clearly a surgeon at the top of his game who has vast experience. I echo the comments here re his secretary Donna who was kind, efficient and first class.",
    "Date":"5th July 2022",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I have found Mr Shaikh to be a truly excellent surgeon. He is kind, reassuring and leaves one with a sense of confidence in one's treatment.",
    "Date":"22nd June 2022",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"A very lovely gentleman, who listens and cares. I would recommend him to everyone. Has a great sense of humour, intelligent kind and caring.",
    "Date":"22nd June 2022",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I had a consultation with Mr Shaikh after an urgent and worrying referral from my GP. In advance of my appointment, I spoke to his secretary, Donna who was very helpful and knowledgeable. She put me more at ease about my appointment.\nDuring my appointment, Mr Shaikh put my mind at ease and explained everything in good depth and detail. He also put my mind at ease by putting a plan in the place for the future. He is very personable and I would not want to go to another consultant for my condition now after seeing him.",
    "Date":"13th June 2022",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"On recommendation, I made an appointment with Mr Irshad Shaikh at Spire, Norwich\nfor a long-term bowl problem. His manner and expertise was first-class and gave me\ncomplete reassurance regarding my problem for now and the foreseeable future.\nii am very grateful.",
    "Date":"6th June 2022",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I had robotic keyhole surgery in February for bowel cancer and can only praise Mr Shaikh and his team and the Norfolk and Norwich hospital staff for the care I was given over the last 5 months. I am now coming to the end of chemotherapy treatment and confident of a positive outcome and looking forward to being cancer free.",
    "Date":"31st May 2022",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"In 2017 I was diagnosed with peri-pancreatic cancer with the discovery (following jaundice) of a small tumour on my bile duct. The diagnosis was in Norwich but Addenbrooke’s in Cambridge was where I was sent for surgery. A Whipple’s procedure was carried out in the Summer of 2017 and was deemed to be successful. The procedure was followed up with a course of chemotherapy in Norwich. \nIn January 2019 I was admitted to The Norwich and Norfolk hospital with severe abdominal pain. A colonic tumour was detected and removed in an emergency operation. After the operation I was left with a stoma. Again the surgery was successful and was followed up with a course of Chemotherapy.\n In the Summer of 2020 investigation of pain in the rectal stump revealed another tumour and I began to be investigated by Mr Shaikh and his team with the purpose of seeing if surgery could be offered. All of us were aware of the extent of the surgery already undergone and Mr Shaikh particularly was aware of my discomfort from a large hernia on the previous operation sites. A multidisciplinary team agreed that an operation should be offered and I had preparatory radio and chemotherapy in the Autumn. The operation was carried out in March 2021 and included three teams: a Urology team, Mr Shaikh’s colorectal team and a perineal reconstructive surgical team. In the event a complete pelvic exenteration was carried out and a urostomy left in place alongside the colostomy. \nMy discussions all along the way with Mr Shaikh and his team of specialists were of inestimable importance in my confidence of their care. I was always fully aware of what was being planned and what the likely outcomes were. The facility of robotic surgery being available and deployable by Mr Shaikh was clearly important in the success of this third major operation given the likely complications which might have arisen. I am very grateful to Mr Shaikh for his expertise and care in his dealing with me. Our interaction continues because even though it is over a year since the last operation I still have a pelvic drain in place. This evidentially is still very much needed and Mr Shaikh is always happy to have informative conversations and consultations about next steps. I would also like to add that the team of colorectal nurse specialists who work with Mr Shaikh have provided wonderful advice and care. I appear to be cancer free at the moment.\nI am not unaware of the expense of the treatment I have received particularly in the use of robotic techniques. I am however extremely grateful that they have been available and used in my case. Less precise surgical techniques may well have not been successful or indeed deployable.                Michael Marshall.",
    "Date":"20th May 2022",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":4,
    "Listening Stars":4
  },
  {
    "Review Text":"I was extremely anxious at my first outpatient appointment, but Mr Shaikh was amazing.  He is a highly skilled surgeon, very professional and caring.  He took time explaining to me the procedures needed and was excellent after surgery too, with follow up advice.  This was backed up by his very helpful secretary, Donna, who was great at booking all procedures and appointments and of course the fantastic healthcare professionals at Spire, Norwich - it made for a good experience at a very worrying time.  Absolutely no regrets about my surgery which has been life-changing!  Thank you",
    "Date":"17th May 2022",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Mr Shaikh was amazing throughout my treatment for bowel cancer. I felt in very safe hands thought what was an extremely difficult time, he is obviously very knowledgeable and skilled but on top of this always took the time to chat with me and answer my questions\/make suggestions. My surgery was completed with the surgical robot, my recovery from what was a major operation has been really quite rapid. Less than 6 months later I’m back to my very active lifestyle and in fact am doing a lot more now the underlying issue has been resolved. The lack of any real signs of having had the operation other than a few scars which continue to fade is absolutely astonishing. I can’t thank Mr Shaikh enough and would highly recommend him and the surgical robot as an approach. Thank You! Sam Brown.",
    "Date":"5th May 2022",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Mr Sheikh listened to all my concerns, explained the findings from the procedures I had had and told me about the options very clearly. He put me at my ease and was extremely reassuring.",
    "Date":"21st April 2022",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Great guy, made the whole process straight forward and put my mind at ease throughout.\n\nI would not hesitate to recommend him to anyone going through the same problems.\n\nGreat guy.",
    "Date":"7th April 2022",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Excellent care throughout, from consultation, to procedure to follow up appointment. Listened to all my concerns and gave good advise. I had suffered with haemorrhoids for many years, took the decision after speaking to Mr Shaikh to have a haemorrhoidectomy, absolutely the correct option. Everything about the operation and after care was clearly explained so i knew exactly what to expect.",
    "Date":"12th March 2022",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Excellent care from start to finish would certainly recommend. Very professional but personable, l felt genuinely cared for. Brilliant secretary, Donna Lorne very helpful from the initial call and throughout the treatment.",
    "Date":"2nd March 2022",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I would like to thank Mr Shaikh and the excellent team at NNUH following my recent rectopexy operation. Since before the pandemic I had been in considerable pain, was experiencing heavy blood loss and was only able to stand for a few minutes at a time. This was especially difficult as I care for my husband who is 90 years old so my condition not only affected me but him and my family as well. The care I received from the nursing staff was second to none and from admission to discharge I was looked after with kindness and respect. The food I was served was quite frankly inedible but that was the only part of my patient experience that was not up to scratch.\nI really appreciate the fact that my operation was able to go ahead during what I know is a difficult time for the hospital. It has made so much difference to my quality of life and I know I am so lucky to have found such as excellent surgeon as Mr Shaikh. I would not hesitate to recommend him to anyone as he went above and beyond my expectations.",
    "Date":"17th February 2022",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Procedure was well explained. Dr Shaikh and Donna were both on hand to answer questions and reassure before and afterwards. Result better than expected. Really pleased.",
    "Date":"21st January 2022",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"After waiting a long time on an NHS waiting list for an operation for a prolapsed rectal problem I decided to go private. From the 1st consultation Mr Shaikh was very helpful at diagnosing my problem and offering a number of options. His private secretary was very supportive in providing me with quotations and logistics. The operation was conducted as a private patient at the Norfolk and Norwich hospital and I received fantastic care. I have recently been seen him again for a final check up and I am pleased to say the operation has been a success for me. Mr Shaikh has provided me with great care . Thank you.",
    "Date":"18th January 2022",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Mr Shaikh takes the time to listen and answer all questions. He has impeccable bedside manners and above all he is an excellent surgeon!",
    "Date":"15th November 2021",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I was lucky enough to be put in the care Mr Shaikh to perform my rectal prolapse surgery in September 2021. I was lucky enough to have the surgery performed laparoscopically and robotically a break through procedure that NNUH offer under Mr Shaikh’s care. I concider myself extremely lucky as this facility is pretty sort after and as I understand there are only a handful of hospitals in the UK that have the luxury of this technology and Expertise like Mr Shiakh has. Even during the midst of lockdown due to covid my care from everyone at the NNUH was second to none! We really are lucky to have such gifted and experienced surgeons within the NHS and I thank him greatly for literally changing my life!",
    "Date":"13th September 2021",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Mr Shaikhs understanding and professionalism was far more helpful than my local GP. He was extremely informative and made the whole process run smoothly from start to finish.",
    "Date":"10th June 2021",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Always professional\nApproachable\nQuick and accurate diagnosis\nGood sense of humour",
    "Date":"9th June 2021",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"At my first consultation with Dr Shaikh at The Spire clinic  I felt so at ease, he spent time explaining my options and giving me time to think which option to go for.He performed a lateral anul sphincterotomy which has been a life changing operation for me.Dr Shaikh has given me my life back,now pain free I could never thank him enough. He was the first person I had seen that actually understood the pain I was in that meant so much to me.His secretary was just as helpful when I had to ring her, what a great team. The nursing staff and care at the Spire Norwich Hospital was fantastic.",
    "Date":"19th May 2021",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Superb from the beginning of the first consultation through to the follow-up after a serious bowel\/colon operation. Reassuring throughout, a true expert, someone you can, quite literally, trust with your life.",
    "Date":"28th April 2021",
    "Category":"NHS",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Mr Shaikh recently carried out a laparoscopic bi-lateral hernia operation on me. He thoroughly explained what the operation entailed, and what to expect post operation. \n \nThe care and attention I received in the Spire Norwich Hospital was absolutely brilliant during these pandemic times. \n\nI am highly delighted with the surgery carried out by Mr Shaikh, it has been a complete success and his skills as a surgeon in my opinion are excellent. \n\nI would also compliment all of his staff for there care and attention to detail pre and post operative, they were very informative and thorough which reassured me.\n\nThe nursing staff at the Spire Norwich Hospital were also very attentive and kind whilst I was there over night.",
    "Date":"13th February 2021",
    "Category":"Private",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"From the beginning, everything was explained, timelines of everything were exactly as I was told, confidence in my operation being successful never in doubt. I felt in extremely good hands all the way. The actual operation was carried out robotically, only hospital I understand that does this in East Anglia. Recovery was far better than I could have wished. My incisions were \"glued\", so there were no stiches to go to have removed. I cannot thank Mr. Shaikh and the whole team for the first class treatment I received at the Norfolk and Norwich hospital.",
    "Date":"19th November 2020",
    "Category":"Unknown",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I was admitted as an emergency with a perforated bowel and had an emergency Hartmanns procedure. \nI owe my life to this lovely man and his team of nurses and helpers. \nHe performed it with keyhole surgery and I am recovering very well with no problems. \nHe has stayed in touch and I am hoping he will be doing a reversal in the near future. \nI and my family are eternally grateful to him. \nI wish to thank him and his team. \nI stayed in Dilham ward whilst recovering and would like to also say a special thank you to all of the nurses there, especially to Myra who was lovely and Nigella who I really loved and was so kind to me, don’t know their surnames but both wore green uniforms. \nThe stoma nurses there was also very nice and really helped me.",
    "Date":"11th November 2020",
    "Category":"Unknown",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I liked that I felt so comfortable with Mr Shaikh & he put me at ease in my initial consultation, as I felt extremely nervous prior to my appointment.",
    "Date":"12th October 2020",
    "Category":"Unknown",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Following a very worrying incident of rectal bleeding I was referred by my GP under the two- week cancer pathway. I was placed in the care of Mr Shaikh’s team. You can imagine that the very mention of  Cancer strikes panic and fear.  The following colonoscopy showing a lesion in the wall of my bowel added to my trepidation that I had contracted Cancer.\nGiven the extreme pressure that the NHS is under due to the Covid crisis it was unlikely that my case would be reviewed for some weeks leaving me in a state of extreme anxiety. After direct contact with Mr Shakhi I was able to arrange a consultation with him and with minutes of starting my consultation he was able to reassure me that it was not Cancer moreover he was able to give a possible cause of the lesion discovered. My emotional response was meet with great compassion. \nHad it not been for his swift and supportive action I should have still been left with the Sword of Damocles hanging over my head. His plan for my future management of my condition has filled me with great confidence that my ordeal is now fully under control.\nHe is truly an outstanding Doctor and a very caring individual  \nColin Shirley",
    "Date":"18th September 2020",
    "Category":"Unknown",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Really listened to the problem and paid attention. Great doctor care and information goven",
    "Date":"15th September 2020",
    "Category":"Unknown",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I had a double hernia operation performed through keyhole surgery by Mr Shaikh.The very nature of the hernias made it difficult to perform through keyhole ( keyhole was my preferred choice) but after Mr Shaikh explained things fully I was filled with confidence.At no time did he tire of my questions before and after surgery, this certainly put my mind at rest knowing how and what had to be done which I am sure aided my recovery.I have no hesitation in recommending Mr Shaikh, his expertise and care were first class.I always felt he would go the extra mile.",
    "Date":"17th August 2020",
    "Category":"Unknown",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Dr Shaikh, I would like to thank you for the difference you make in the live of your patients. Your kindness, sincere, caring and supportive make everyone else better and also a great encouragement.\nThanks a million times",
    "Date":"3rd June 2020",
    "Category":"Unknown",
    "Recommend Stars":0,
    "Trust Stars":0,
    "Listening Stars":0
  },
  {
    "Review Text":"Thank you for saving my mother's life last March Mrs Margaret Bradley she's doing well now all down to your great skill we cannot thank you enough from her family she's now 82",
    "Date":"14th May 2020",
    "Category":"Unknown",
    "Recommend Stars":0,
    "Trust Stars":0,
    "Listening Stars":0
  },
  {
    "Review Text":"I had been suffering with severe anal pain for many months and getting nowhere fast with various prescribed ointments. Mr Shaikh quickly diagnosed an anal fissure and soon thereafter performed a lateral internal sphincterotomy.\nI would recommend the procedure to anyone dealing with this condition as the fissure pain disappeared instantly. I was sore for a week or so after but I was able to return to office based work after 5 days and light exercise after a few of weeks. Six weeks on Mr Shaikh has confirmed the fissure has completely healed and I am so pleased.",
    "Date":"17th March 2020",
    "Category":"Unknown",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":3
  },
  {
    "Review Text":"A fantastic man .\nI had a very large hernia (it was so large was filmed for training)that mr Shaikh did by keyhole surgery I was in hospital at 1 pm and home by 7 pm I had very little pain the following day I went for a long walk on the beach and used very little pain killers for 2 days only .\nA highly recommend surgeon .",
    "Date":"11th February 2020",
    "Category":"Unknown",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"In relation to other conditions experienced by patients in this review mine was somewhat minor.  Although it brought annoying levels of discomfort when sitting, and prevented me from enjoying my favourite past time of cycling.\nMy GP had diagnosed a pilonidal sinus in April 2018, saying that there was little that could be done medically except a surgical intervention if the condition deteriorated.\nBy November 2018 my tolerance level had reached zero, I asked my GP to arrange a consultation at the Spire Hospital with a view to a surgical intervention.\nAs a result I had a consultation with Mr Shaikh, who I found to be a good listener in the extreme; he displayed a high level of empathy and explained in easily understood terms the options open to me. He stressed that the surgical route although available was not without risks associated with the anal part of the body. He suggested that I wait and watch whilst maintaining an extreme level of hygiene and hopefully the condition would clear up. However, if the problem persisted I was contact him again in March to re-visit the probability of a surgical procedure.\n By following Mr Shaikh’s advice rigorously for several weeks the condition improved and eventually healed completely. A surgical solution was not required.\nAlthough in the realm of private health care, there was never any pressure to take the more expensive surgical option.\nWithout any hesitation I would say that Mr Shaikh is a solid, approachable and caring individual who places the wellbeing of his patients first.",
    "Date":"30th April 2019",
    "Category":"Unknown",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I was referred to Mr Shaikh by my local hospital to perform surgery for anal cancer.  From my first consultation with him he demonstrated great empathy for my situation, without patronising me.  He fully explained the very complex procedure along with all the ‘pros’ and ‘cons’.  He described realistic expectations in an honest, but gentle manner.\nHe showed respect for me as a patient and answered all questions fully, without making me feel that I was asking silly questions.  He kept me fully informed of the treatment I could expect, even phoning me a couple of days before my planned op date to update me on information he had received from colleagues.\nMy operation was totally successful I am delighted to say.  \nWhilst on the ward, Mr Shaikh and the surgical team continued to treat me with respect, informing me of my condition and outcomes in an honest, professional but friendly manner.   The whole experience was totally patient centred.\nAt a follow up appointment some weeks after discharge Mr Shaikh was encouraging and motivational about my good recovery, which, no doubt, aided my recovery further.\nI extend this positive review and sincere thanks to the whole of the colorectal surgical team and nurses that supported me on Dilham ward and HDU during my stay at NNUH.",
    "Date":"3rd April 2019",
    "Category":"Unknown",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Dr Shaikh is a very helpful and friendly person.I would recommend him and the team that was working with him 100%. The way things were explained to me before and after my opp were fantastic.",
    "Date":"14th March 2019",
    "Category":"Unknown",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Today we had an initial consaultation with this fantastic Dr . After my Husband being in excruciating pain with a fisher. This marvellous man has offered a fast and simple procedure to hopefully allow us to live our lives again. Surgery is booked for next week and we actually can’t wait.",
    "Date":"29th January 2019",
    "Category":"Unknown",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I had been suffering with a painful backside for about 6 weeks with a gradual increase in severity. I used my local GP service who advised I had an anal fissure. The treatment recommended was very much 'use this cream' and come back if things don't get better. The pain control offered (Naproxen) had absolutely no impact on what I was being hit with. This type of intervention carried on until I was reduced to incapacity to work (self employed), a total panic as to what level of pain I would be suffering from each day and complete despair. I had been admitted to A+E twice where no intervention was offered.\n\nAt this point I contacted Dr Shaikh on advice of the Spire Hospital and attended a consultation. When I arrived at the hospital I was desperate, and extremely alarmed by my terrible pain that would last for hours and absolutely nobody was offering any plan to help. Mr Shaikh changed all that! He listened very carefully to me and agreed with the fissure diagnosis BUT also explained my symptoms were not typical for a fissure, how right he was. Mr Shaikh had such great empathy with my predicament, here was somebody saying that they understood how much pain I was in and it was going to stop. It was the best I had felt in weeks  He was excellent at explaining my anatomy and how that was relevant to my problem. Ultimately he offered a number of treatment options (and described the limitations of each) that he would be able to perform. Unfortunately things progressed to a crescendo of trouble even before Mr Shaikh could operate and the emergency unit of the local hospital were superb. Mr Shaikh was of course correct, a fissure was a small part of the problem with fistulas and abscesses all present  as well. Sadly my local G.Ps had not considered  these possible additional joys in the diagnostic process \nIn summary, Mr Shaikh is one of the most compassionate, professional and diligent people I have ever had the pleasure of meeting. His experience and good humour lifted my spirit at a very dark time and I would entirely recommend him to anyone requiring the very best care",
    "Date":"10th December 2018",
    "Category":"Unknown",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I have been treated by Mr Shaike since September 2016  I have had two operations    For cancer  .From thestart Mr Shaike has explained everything clearly to me & my family  very pleasant & caring person . I have had  a few problems along the way  but am so thankful to him & his team for all their care . Having follow up appointments  for some time . I am so grateful to Mr Shaike  for giving me   More time with my precious  grandchildren.so pleased he has received an awardcould not have gone to a better person .",
    "Date":"21st October 2018",
    "Category":"Unknown",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"From the outset Mr Sheikh put me at my ease and I quickly realised I could not have been in more reassuring and kind hands. His listening approach and sense of humour certainly helped enormously. For everything to then happen so quickly and smoothly was very comforting for me.  I could not have wished for more, and in the end my procedure was not quite as horrendous as I feared is was going to be and it all seemed over in no time.  \n\nFor all that I am most grateful indeed to Mr Sheikh and have no hesitation in recommending him most highly.",
    "Date":"13th October 2018",
    "Category":"Unknown",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"After being given the runaround by the NHS I went private and was referred to Mr Shaikh. I had spent 6 months with the NHS going through all sorts of tests and having a consultant who wasn't listening to my concerns nor caring about what had happened. \n\nMr Shaikh was very reassuring and put me at ease as soon as I sat down with him, he listened fully to everything I said and discussed everything in detail with me. It took one ultrasound and a look at my previous MRI scan for him and a radiologist to come to a diagnosis within 2 weeks. \n\nI cannot thank him enough for the help and reassurance he provided me, along with the diagnosis that put my mind at ease. Judging by his previous reviews I can see I'm not the only one happy with his work. I would highly recommend.",
    "Date":"6th August 2018",
    "Category":"Unknown",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Mr Shaikh performed a lateral anal sphyncterectomy on me due to an anal fissure. I had suffered in extreme pain for just under a year and tried every cream and ointment available from the doctors. I was getting to the stage where it was not only excruciatingly painful going to the toilet but for hours after I would endure throbbing and burning sensations that would bring me to tears.\nMr Shaikh explained the two options of either having botox injected or the sphyncterectomy. I understood that with the latter there is a chance of incontinence after the operation but that the success rate was much much higher than the botox.\nAfter having the operation I felt immediate relief from the pain. The first time I went to the toilet it was only slightly uncomfortable but no pain afterwards. I took some Cosmocol three times a day for a couple of weeks to make sure I didn’t get constipated as well. \nI can honestly say having the operation was the best choice I made and I have now healed really well and no longer worry about leaving the house or spending hours lying on my bed in pain.\nOther than the immediate healing and small amounts of blood, I have had absolutely no problem with incontinence and still have really good control over my muscles and when I go to the toilet.\nI cannot recommend this surgery enough and should I ever find myself with a fissure again in the future I will not hesitate to get it done again.\nMr Shaikh was extremely efficient, knowledgeable and experienced and i felt confident that he knew exactly what he was doing.\nIn addition, his secretary Donna, was one of the most professional and helpful people I have ever dealt with and made the whole experience much easier for me.",
    "Date":"28th March 2018",
    "Category":"Unknown",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I recently attended Spire Hospital outpatients for a colonoscopy under the care of Mr Irshad Shaikh . Being a person who feels really nervous around hospitals I found him to be really sympathetic and understanding. From initial consultation, procedure day and follow up consultation everything was done with care and professionalism.\nMr Shaikh and his team made me feel at ease through the whole experience as did the friendly Spire Hospital staff who looked after me before and after my procedure.\n\nI would highly recommend.",
    "Date":"28th March 2018",
    "Category":"Unknown",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I am a doctor who has recently been very ill with a burst appendix. After 30 years of dedication to the NHS I expected to receive the same care as anyone else in a crisis. I was let down by a system without any spare resource. The nurses, doctors and health care assistants (the unsung heroes of our NHS) were overwhelmed.\nDuring 4 days of chaotic care it became evident to me that the only source of continuity is the Consultant who chooses to go beyond the call of duty. In my day they had us as a team - House Officer, SHO, Registrar and Senior Registrar directly accountable. 4 of us to one of them.  Nowadays they share a rotating shift of juniors without a direct line of responsibility. 3 juniors shared between 3 consultants!!  A recipe for disaster. BUT.....Irshad Shaikh and Sandeep Kapur go beyond the call of duty.  They are not superhuman but you're as safe with them as you can be! Relax",
    "Date":"10th January 2018",
    "Category":"Unknown",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"After suffering with piles for the past few years, it got to the point where the nagging and excruciating pain had become constant and unbearable, (not good when I'm a keen Road cyclist and Mountain Biker!!), so from the onset of 2017 I was going to get this sorted, once and for all, albeit having to overcome the embarrassment, with some apprehension.\nEarly in the year I was referred to Mr Shaikh, where from the onset he instantly made me feel such at ease, with his professionalism, very approachable personality, and his empathetic approach to my very personal and would-be embarrassing problem. It certainly helped that he has a good sense of humour too!\nHe explained everything very clearly and made sure I knew what all the options were that were open to me, and what all the pro's, con's and success rates were for each of the options. \nUnfortunately for me I had to go through all of the options along the path to (hopefully) finally getting sorted, from initially starting off with the \"banding\" process, through to having 2 bouts of surgery, under General Anaesthetic. At each and every step of the way, Mr Shaikh was absolutely brilliant, such care and dedication in making sure I was ok, explaining everything thoroughly, and what to expect during the recovery process. \nI saw Mr Shaikh, last Tuesday (10th October), where he was pleased with my recovery, to such an extent that he has signed me back over to my own GP.\nI am still in the \"Healing\" stage at present, but what a transformation from where I initially started out from. I cannot speak more highly of, nor recommend Mr Shaikh more, for this transformation. I am hugely thankful to Mr Shaikh, as this has also brought me a much better state of well-being too! Looking forwards to \"pain-free\" cycling from now on!!",
    "Date":"14th October 2017",
    "Category":"Unknown",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Excellent understanding and advice. Chose sphincterotomy rather than botox injection and would recommend this as an option to others to cure this problem.",
    "Date":"14th July 2017",
    "Category":"Unknown",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Great service and very professional the only comment I would make is to speak a little more slowly to allow patients to absorb information",
    "Date":"3rd July 2017",
    "Category":"Unknown",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Mr Shaikh has been the ultimate professional, he is extremely knowledgeable in the field and very dedicated.  he also shows compassion and care on what is an embarrassing problem to have.\n\nI would highly recommend",
    "Date":"30th June 2017",
    "Category":"Unknown",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Having spent the first  four months of this year house bound because of a prolapsed bowel, with embarrassing and distressing symptoms, I was relieved to be referred to Mr Shaikh. He explained the surgical procedure for a Laparascopic rectal mesh operation very clearly and after diagnostic tests I was admitted to the Norfolk and Norwich Hospital in May. The result is nothing short of a miracle. I am now back to my normal life and activities and cannot thank Mr Shaikh enough. Thanks, too, to the Anaesthetist and nursing staff for their care and attention.",
    "Date":"14th June 2017",
    "Category":"Unknown",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Following diagnostic procedures I was seen by Mr Sheikh who very clearly discussed my problem and the operation he proposed to carry out. The major operation performed by Mr Shaikh and his staff was a great success and the care I received at the Norfolk & Norwich Hospital was first class. Mr Shaikh has continued to see me and he has very patiently and carefully explained the next steps to aid my full recovery. I can not thank Mr Shaikh enough for everything he has done for me and the caring and professional manner in which he has carried it out.",
    "Date":"30th November 2016",
    "Category":"Unknown",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Mr Shaikh was great from the first day we met to the operation and the post op meeting.  Very friendy with a good sense of humour.\n\nHe was professional throughout and did a great job on my hernia op with no problems and very little discomfort after the first 3 days.\n\nI would recommend this gentleman without a doubt.\n\nWell done Irshad and may thanks, keep up the great work.",
    "Date":"15th November 2016",
    "Category":"Unknown",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Mr Shaikh treated me with courtesy, kindness and consideration.  Following diagnostic testing he explained my condition fully and answered my questions very clearly.  I can thoroughly recommend him.",
    "Date":"12th November 2016",
    "Category":"Unknown",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Laparoscopic rectiplexy\nSacrocolpoplexy(including laparoscopic)\nMr Shaikh and Mr Mukhopadhyay both operated on me at the same time, they were very, very good in their pre and post op care, the operation was very complicated and took longer than we expected, but so far, so good. Day one was pretty uncomfortable, being checked every hour for blood pressure, temperature, pulse, etc.  Day two showered alone after quite a Good night, not too mobile but managed to walk to the bathroom, and managed it alone, scar quite uncomfortable but not too bad, day three sent home. First week very limited in doing anything for myself, went to GP and nurse removed clips from wound on tenth day, hadn't healed completely so had to visit GP every other day for redressing, week two much improved but still quite limited and having wound dressed. Dressings down to every other day. Week three improving every day, eventually told no dressings needed. Great news. Week four, feeling much more like my older self, still have to be careful on lifting, stretching etc but much more mobile. Must just remember not to do too much. Saw Mr Shaikh and he's told me that I am doing well and to take things easy as it's very early days, didn't realise what a big op this was. Can't fault Mr Shaikh and Mr Mukhopadhyay they have been amazing. Thank you guys.",
    "Date":"18th October 2016",
    "Category":"Unknown",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Mr Shaikh was very welcoming and considerate right from my first visit. He discussed my options clearly with both me and my husband, even drawing a basic diagram to help us understand better. I am pleased to say that the operation he performed was a complete success.",
    "Date":"7th September 2016",
    "Category":"Unknown",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Mr Shaikh was excellent, he had been advised that I was nervous and was very considerate of this in my treatment. Reassuring me all the time.",
    "Date":"12th January 2016",
    "Category":"Unknown",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Following a consultation and examination on 29 Dec 15, Mr. Shaikh went into great detail to explain about the low fistula condition and options regarding surgery. I found him to be very caring and positive in all aspects.of the procedure.",
    "Date":"30th December 2015",
    "Category":"Unknown",
    "Recommend Stars":4,
    "Trust Stars":4,
    "Listening Stars":4
  },
  {
    "Review Text":"Mr Shaikh was excellent in his approach to my consultation, operation and post operative care.  I am a nervous patient but my mind was put at rest, all the options and consequences were explained to me very well and I felt secure proceeding with the operation.  Good attention to detail and reassurance during recovery when you sometimes have questions after your recovery.",
    "Date":"11th December 2015",
    "Category":"Unknown",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Following consultation with Mr Shaikh I was required to have a colonoscopy with snare loop biopsy or excision of lesion.\nAll this was explained to me in a calm, sympathetic manner with professional reassurance by Mr Shaikh.\nThe results have been clearly given to me, and I have had only care and consideration shown, both during consultation and the diagnostic tests, and also by the staff at The Spire Hospital when the procedures were taking place.",
    "Date":"24th November 2015",
    "Category":"Unknown",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"A professional and courteous consultant with a very approachable manner. I formed a high regard of Irshad and have no hesitation in recommending his skills and experience.",
    "Date":"17th November 2015",
    "Category":"Unknown",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I recently had a procedure carried out by Mr. Shaikh. He explained everything to me very well and I was very impressed with his expertise and manner. I would have no hesitation in recommending him, and would also request him to carry out any further treatment I may need in the future.",
    "Date":"13th October 2015",
    "Category":"Unknown",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"Mr Shaikh is to carry out my partner's stoma reversal. Discussing the operation, he explained the possible difficulties and the advantages, and carefully and sympathetically dealt with our questions. His straightforward and pleasant manner inspires confidence.",
    "Date":"1st December 2014",
    "Category":"Unknown",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  },
  {
    "Review Text":"I saw Mr Shaikh today regarding my CT scan following surgery for colon cancer in Dec 2012. I had been told over the phone it was clear, but some marks had been found at site of surgery. I was concerned but he took the time to explain there was no recurrence of the cancer and there was nothing to worry about. He has arranged for a test I should had last year and I was very pleased with the treatment I received. I would be very happy to be treated by Mr Shaikh again, but he is moving on in a few weeks. I wish him well in his new post.",
    "Date":"18th September 2014",
    "Category":"Unknown",
    "Recommend Stars":5,
    "Trust Stars":5,
    "Listening Stars":5
  }
]